{
    "title": "Privacy Policy",
    "lastUpdated": "Last updated: January 2026",
    "sections": {
        "introduction": {
            "title": "1. Introduction",
            "content": "WSXJS ('we', 'our', or 'us') is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you use our open-source framework and website."
        },
        "dataCollection": {
            "title": "2. Information We Collect",
            "content": "As an open-source project, we collect minimal information:",
            "items": {
                "usage": "Usage analytics (anonymized) to improve the framework",
                "errors": "Error logs and crash reports to fix bugs",
                "device": "Device and browser information for compatibility testing"
            }
        },
        "dataUsage": {
            "title": "3. How We Use Your Information",
            "content": "We use the collected information to:",
            "items": {
                "improve": "Improve and maintain the WSXJS framework",
                "communicate": "Respond to your inquiries and provide support",
                "comply": "Comply with legal obligations"
            }
        },
        "dataSharing": {
            "title": "4. Data Sharing",
            "content": "We do not sell, trade, or rent your personal information. We may share anonymized, aggregated data with third-party analytics services to help us understand how the framework is used."
        },
        "dataSecurity": {
            "title": "5. Data Security",
            "content": "We implement appropriate technical and organizational measures to protect your information. However, no method of transmission over the Internet is 100% secure."
        },
        "cookies": {
            "title": "6. Cookies and Tracking",
            "content": "We use cookies and similar tracking technologies to analyze website traffic and improve user experience. You can control cookies through your browser settings."
        },
        "userRights": {
            "title": "7. Your Rights",
            "content": "Depending on your location, you may have the following rights:",
            "items": {
                "access": "Right to access your personal data",
                "correct": "Right to correct inaccurate data",
                "delete": "Right to request deletion of your data",
                "object": "Right to object to processing of your data"
            }
        },
        "children": {
            "title": "8. Children's Privacy",
            "content": "Our services are not directed to individuals under the age of 13. We do not knowingly collect personal information from children."
        },
        "changes": {
            "title": "9. Changes to This Policy",
            "content": "We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new policy on this page and updating the 'Last updated' date."
        },
        "contact": {
            "title": "10. Contact Us",
            "content": "If you have questions about this Privacy Policy, please contact us:",
            "email": "Email"
        }
    }
}
